app/controllers/admin/videos_controller.rb

INSERT INTO "videos" ("category_id", "created_at", "description", "title", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @video = Video.create(video_params)