app/views/users/show.html.haml

SELECT COUNT(*) FROM "queue_items" WHERE "queue_items"."user_id" = ?  [["user_id", 1]]
---
          %img(src="http://www.gravatar.com/avatar/#{Digest::MD5.hexdigest(@user.email.downcase)}?s=40")
          %h2 #{@user.full_name}'s video collections (#{@user.queue_items.count})

SELECT COUNT(*) FROM "reviews" WHERE "reviews"."user_id" = ?  [["user_id", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = ? ORDER BY created_at DESC  [["user_id", 1]]
---
      %header
        %h3 #{@user.full_name}'s Reviews  (#{@user.reviews.count})
      %ul
        - @user.reviews.each do |review|