app/controllers/invitations_controller.rb

INSERT INTO "invitations" ("created_at", "inviter_id", "message", "recipient_email", "recipient_name", "token", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @invitation = Invitation.new(invitation_params.merge!(inviter_id: current_user.id))
    if @invitation.save