app/controllers/password_resets_controller.rb

SELECT "users".* FROM "users" WHERE "users"."token" = 'uTHXLA_Lqq10u_ivjZnVfQ' ORDER BY "users"."id" ASC LIMIT 1
---
  def show
    user = User.where(token: params[:id]).first

SELECT "users".* FROM "users" WHERE "users"."token" = 'uTHXLA_Lqq10u_ivjZnVfQ' ORDER BY "users"."id" ASC LIMIT 1
UPDATE "users" SET "password_digest" = ?, "token" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["password_digest", "$2a$10$iEzhpQBJlLvP2AjpIFE5mugyZJ4FDVHPBSTwDLJfUAUoZYbvjnQUC"], ["token", "JGqUmNnM9cebvsNHNXJ8wA"], ["updated_at", Mon, 09 Dec 2013 22:52:41 UTC +00:00]]
---
  def create
    user = User.where(token: params[:token]).first
    if user
      user.password = params[:password]
      user.generate_token
      user.save