app/controllers/queue_items_controller.rb

  def create
    video = Video.find(params[:video_id])
---
SELECT "videos".* FROM "videos" WHERE "videos"."id" = ? ORDER BY "videos"."id" ASC LIMIT 1  [["id", 1]]

  def destroy
    queue_item = QueueItem.find(params[:id])
    queue_item.destroy if current_user.queue_items.include?(queue_item)
---
SELECT "queue_items".* FROM "queue_items" WHERE "queue_items"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "queue_items" WHERE "queue_items"."id" = ?  [["id", 2]]
SELECT 1 AS one FROM "queue_items" WHERE "queue_items"."user_id" = ? AND "queue_items"."id" = 2 LIMIT 1  [["user_id", 1]]