app/controllers/relationships_controller.rb

  def destroy
    relationship = Relationship.find(params[:id])
    relationship.destroy if relationship.follower == current_user
---
SELECT "relationships".* FROM "relationships" WHERE "relationships"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "relationships" WHERE "relationships"."id" = ?  [["id", 2]]