app/controllers/reviews_controller.rb

  def create
    @video = Video.find(params[:video_id])
    review = @video.reviews.build(review_params.merge!(user: current_user))
    if review.save
---
SELECT "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT 1  [["id", "9"]]
INSERT INTO "reviews" ("content", "created_at", "rating", "updated_at", "user_id", "video_id") VALUES (?, ?, ?, ?, ?, ?)  [["content", "nice video"], ["created_at", Tue, 03 Dec 2013 00:06:05 UTC +00:00], ["rating", 4], ["updated_at", Tue, 03 Dec 2013 00:06:05 UTC +00:00], ["user_id", 1], ["video_id", 9]]