app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = '' ORDER BY "users"."id" ASC LIMIT 1
---
  def create
    user = User.where(email: params[:email]).first