app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "full_name", "password_digest", "token", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT "invitations".* FROM "invitations" WHERE "invitations"."token" = 'qi5oC86igiza8dR6x0AWZw' ORDER BY "invitations"."id" ASC LIMIT 1
---
  def new_with_invitation_token
    invitation = Invitation.where(token: params[:token]).first