app/controllers/videos_controller.rb

  def index
    @videos = Video.all
    @categories = Category.all
---
SELECT "videos".* FROM "videos"
SELECT "categories".* FROM "categories"

  def show
    @video = Video.find(params[:id])
---
SELECT "videos".* FROM "videos" WHERE "videos"."id" = ? ORDER BY "videos"."id" ASC LIMIT 1  [["id", 10]]