app/views/categories/show.html.haml

  .videos.row
    - @category.videos.each do |video|
      .video.col-sm-2
---
SELECT "videos".* FROM "videos" WHERE "videos"."category_id" = ? ORDER BY created_at DESC  [["category_id", 2]]