app/views/admin/videos/new.html.haml

SELECT "categories".* FROM "categories"
---
            = f.text_field :title, class: "span3"
            = f.select :category_id, options_for_select(Category.all.map {|category| [category.name, category.id]})